## Pandas Library
### Data frame

In [45]:
import pandas as pd
pd.__version__

u'0.19.2'

In [48]:
frame = pd.DataFrame({'numbers':range(10), 'chars':['a']*10})
i = range(10)
j = [1,2,3]
k = j*10
print type(i)
print type(j)
print type(k)
print k

<type 'list'>
<type 'list'>
<type 'list'>
[1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3]

In [8]:
frame

  chars  numbers
0     a        0
1     a        1
2     a        2
3     a        3
4     a        4
5     a        5
6     a        6
7     a        7
8     a        8
9     a        9

In [49]:
frame.info()
#?pd.read_csv

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
chars      10 non-null object
numbers    10 non-null int64
dtypes: int64(1), object(1)
memory usage: 232.0+ bytes

In [16]:
frame.shape[0]

10

In [17]:
frame.columns

Index([u'chars', u'numbers'], dtype='object')

In [18]:
frame = pd.read_csv('dataset.tsv', sep='\t')

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [37]:
frame['Address'] = ['']*frame.shape[0]
#frame.drop(range(0,3), axis=0, inplace='')
frame

              Name       Birth       City  Position Address
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [42]:
frame = pd.read_csv('dataset.tsv', sep='\t', header=0)
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [44]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [ ]:
frame.add